example/app/controllers/articles_controller.rb

SELECT * FROM "articles"
---
  def index
    @articles = Article.all.paginate(:per_page => 10, :page => params[:page])